applications/test/heatTransfer/buoyantDBS/BernardCells/system/fvSolution.bk
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|e)Final"
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 50;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;

    pRefCell          0;
    pRefValue         0;

    outerCorrectorResidualControl
    {
        "(U|e)"       
        {
            tolerance  1e-4;
            relTol     0;
        }
        
     }
}

relaxationFactors
{
    fields
    {
        "rho.*"         1.0;
        "p_rgh.*"       0.7;
    }
    equations
    {
        "U.*"            0.7;
        "e.*"            0.7;
    }
}


// ************************************************************************* //
